MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA412/mcu.h
extern volatile ANSABITS ANSAbits __attribute__((__sfr__));

#define ANSELA ANSELA
extern volatile uint16_t ANSELA __attribute__((__sfr__));
__extension__ typedef struct tagANSELABITS {
  union {
    struct {
      uint16_t ANSA0:1;
      uint16_t :1;
      uint16_t ANSA2:1;
      uint16_t ANSA3:1;
      uint16_t :1;
      uint16_t ANSA5:1;
      uint16_t ANSA6:1;
      uint16_t ANSA7:1;
      uint16_t :1;
      uint16_t ANSA9:1;
      uint16_t ANSA10:1;
      uint16_t :3;
      uint16_t ANSA14:1;
      uint16_t ANSA15:1;
    };
    struct {
      uint16_t ANSELA0:1;
      uint16_t :1;
      uint16_t ANSELA2:1;
      uint16_t ANSELA3:1;
      uint16_t :1;
      uint16_t ANSELA5:1;
      uint16_t ANSELA6:1;
      uint16_t ANSELA7:1;
      uint16_t :1;
      uint16_t ANSELA9:1;
      uint16_t ANSELA10:1;
      uint16_t :3;
      uint16_t ANSELA14:1;
      uint16_t ANSELA15:1;
    };
  };
} ANSELABITS;
extern volatile ANSELABITS ANSELAbits __attribute__((__sfr__));

#define IOCPA IOCPA
extern volatile uint16_t IOCPA __attribute__((__sfr__));
typedef struct tagIOCPABITS {
  uint16_t IOCPA0:1;
  uint16_t IOCPA1:1;
  uint16_t IOCPA2:1;
  uint16_t IOCPA3:1;
  uint16_t IOCPA4:1;
  uint16_t IOCPA5:1;
  uint16_t IOCPA6:1;
  uint16_t IOCPA7:1;
  uint16_t :1;
  uint16_t IOCPA9:1;
  uint16_t IOCPA10:1;
  uint16_t :3;
  uint16_t IOCPA14:1;
  uint16_t IOCPA15:1;
} IOCPABITS;
extern volatile IOCPABITS IOCPAbits __attribute__((__sfr__));

#define IOCNA IOCNA
extern volatile uint16_t IOCNA __attribute__((__sfr__));
typedef struct tagIOCNABITS {
  uint16_t IOCNA0:1;
  uint16_t IOCNA1:1;
  uint16_t IOCNA2:1;
  uint16_t IOCNA3:1;
  uint16_t IOCNA4:1;
  uint16_t IOCNA5:1;
  uint16_t IOCNA6:1;
  uint16_t IOCNA7:1;
  uint16_t :1;
  uint16_t IOCNA9:1;
  uint16_t IOCNA10:1;
  uint16_t :3;
  uint16_t IOCNA14:1;
  uint16_t IOCNA15:1;
} IOCNABITS;
extern volatile IOCNABITS IOCNAbits __attribute__((__sfr__));

#define IOCFA IOCFA
extern volatile uint16_t IOCFA __attribute__((__sfr__));
typedef struct tagIOCFABITS {
  uint16_t IOCFA0:1;
  uint16_t IOCFA1:1;
  uint16_t IOCFA2:1;
  uint16_t IOCFA3:1;
  uint16_t IOCFA4:1;
  uint16_t IOCFA5:1;
  uint16_t IOCFA6:1;
  uint16_t IOCFA7:1;
  uint16_t :1;
  uint16_t IOCFA9:1;
  uint16_t IOCFA10:1;
  uint16_t :3;
  uint16_t IOCFA14:1;
  uint16_t IOCFA15:1;
} IOCFABITS;
extern volatile IOCFABITS IOCFAbits __attribute__((__sfr__));

#define CNPUA CNPUA
extern volatile uint16_t CNPUA __attribute__((__sfr__));
__extension__ typedef struct tagCNPUABITS {
  union {
    struct {
      uint16_t IOCPA0:1;
      uint16_t IOCPA1:1;
      uint16_t IOCPA2:1;
      uint16_t IOCPA3:1;
      uint16_t IOCPA4:1;
      uint16_t IOCPA5:1;
      uint16_t IOCPA6:1;
      uint16_t IOCPA7:1;
      uint16_t :1;
      uint16_t IOCPA9:1;
      uint16_t IOCPA10:1;
      uint16_t :3;
      uint16_t IOCPA14:1;
      uint16_t IOCPA15:1;
    };
    struct {
      uint16_t IOCPUA0:1;
      uint16_t IOCPUA1:1;
      uint16_t IOCPUA2:1;
      uint16_t IOCPUA3:1;
      uint16_t IOCPUA4:1;
      uint16_t IOCPUA5:1;
      uint16_t IOCPUA6:1;
      uint16_t IOCPUA7:1;
      uint16_t :1;
      uint16_t IOCPUA9:1;
      uint16_t IOCPUA10:1;
      uint16_t :3;
      uint16_t IOCPUA14:1;
      uint16_t IOCPUA15:1;
    };
    struct {
      uint16_t CNPUA0:1;
      uint16_t CNPUA1:1;
      uint16_t CNPUA2:1;
      uint16_t CNPUA3:1;
      uint16_t CNPUA4:1;
      uint16_t CNPUA5:1;
      uint16_t CNPUA6:1;
      uint16_t CNPUA7:1;
      uint16_t :1;
      uint16_t CNPUA9:1;
      uint16_t CNPUA10:1;
      uint16_t :3;
      uint16_t CNPUA14:1;
      uint16_t CNPUA15:1;
    };
  };
} CNPUABITS;
extern volatile CNPUABITS CNPUAbits __attribute__((__sfr__));

#define IOCPUA IOCPUA
extern volatile uint16_t IOCPUA __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUABITS {
  union {
    struct {
      uint16_t IOCPA0:1;
      uint16_t IOCPA1:1;
      uint16_t IOCPA2:1;
      uint16_t IOCPA3:1;
      uint16_t IOCPA4:1;
      uint16_t IOCPA5:1;
      uint16_t IOCPA6:1;
      uint16_t IOCPA7:1;
      uint16_t :1;
      uint16_t IOCPA9:1;
      uint16_t IOCPA10:1;
      uint16_t :3;
      uint16_t IOCPA14:1;
      uint16_t IOCPA15:1;
    };
    struct {
      uint16_t IOCPUA0:1;
      uint16_t IOCPUA1:1;
      uint16_t IOCPUA2:1;
      uint16_t IOCPUA3:1;
      uint16_t IOCPUA4:1;
      uint16_t IOCPUA5:1;
      uint16_t IOCPUA6:1;
      uint16_t IOCPUA7:1;
      uint16_t :1;
      uint16_t IOCPUA9:1;
      uint16_t IOCPUA10:1;
      uint16_t :3;
      uint16_t IOCPUA14:1;
      uint16_t IOCPUA15:1;
    };
    struct {
      uint16_t CNPUA0:1;
      uint16_t CNPUA1:1;
      uint16_t CNPUA2:1;
      uint16_t CNPUA3:1;
      uint16_t CNPUA4:1;
      uint16_t CNPUA5:1;
      uint16_t CNPUA6:1;
      uint16_t CNPUA7:1;
      uint16_t :1;
      uint16_t CNPUA9:1;
      uint16_t CNPUA10:1;
      uint16_t :3;
      uint16_t CNPUA14:1;
      uint16_t CNPUA15:1;
    };
  };
} IOCPUABITS;
extern volatile IOCPUABITS IOCPUAbits __attribute__((__sfr__));

#define CNPDA CNPDA
extern volatile uint16_t CNPDA __attribute__((__sfr__));
__extension__ typedef struct tagCNPDABITS {
  union {
    struct {
      uint16_t IOCPDA0:1;
      uint16_t IOCPDA1:1;
      uint16_t IOCPDA2:1;
      uint16_t IOCPDA3:1;
      uint16_t IOCPDA4:1;
      uint16_t IOCPDA5:1;
      uint16_t IOCPDA6:1;
      uint16_t IOCPDA7:1;
      uint16_t :1;
      uint16_t IOCPDA9:1;
      uint16_t IOCPDA10:1;
      uint16_t :3;
      uint16_t IOCPDA14:1;
      uint16_t IOCPDA15:1;
    };
    struct {
      uint16_t CNPDA0:1;
      uint16_t CNPDA1:1;
      uint16_t CNPDA2:1;
      uint16_t CNPDA3:1;
      uint16_t CNPDA4:1;
      uint16_t CNPDA5:1;
      uint16_t CNPDA6:1;
      uint16_t CNPDA7:1;
      uint16_t :1;
      uint16_t CNPDA9:1;
      uint16_t CNPDA10:1;
      uint16_t :3;
      uint16_t CNPDA14:1;
      uint16_t CNPDA15:1;
    };
  };
} CNPDABITS;
extern volatile CNPDABITS CNPDAbits __attribute__((__sfr__));

#define IOCPDA IOCPDA
extern volatile uint16_t IOCPDA __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDABITS {
  union {
    struct {
      uint16_t IOCPDA0:1;
      uint16_t IOCPDA1:1;
      uint16_t IOCPDA2:1;
      uint16_t IOCPDA3:1;
      uint16_t IOCPDA4:1;
      uint16_t IOCPDA5:1;
      uint16_t IOCPDA6:1;
      uint16_t IOCPDA7:1;
      uint16_t :1;
      uint16_t IOCPDA9:1;
      uint16_t IOCPDA10:1;
      uint16_t :3;
      uint16_t IOCPDA14:1;
      uint16_t IOCPDA15:1;
    };
    struct {
      uint16_t CNPDA0:1;
      uint16_t CNPDA1:1;
      uint16_t CNPDA2:1;
      uint16_t CNPDA3:1;
      uint16_t CNPDA4:1;
      uint16_t CNPDA5:1;
      uint16_t CNPDA6:1;
      uint16_t CNPDA7:1;
      uint16_t :1;
      uint16_t CNPDA9:1;
      uint16_t CNPDA10:1;
      uint16_t :3;
      uint16_t CNPDA14:1;
      uint16_t CNPDA15:1;
    };
  };
} IOCPDABITS;
