MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA412/mcu.h
extern volatile IOCPGBITS IOCPGbits __attribute__((__sfr__));

#define IOCNG IOCNG
extern volatile uint16_t IOCNG __attribute__((__sfr__));
typedef struct tagIOCNGBITS {
  uint16_t IOCNG0:1;
  uint16_t IOCNG1:1;
  uint16_t IOCNG2:1;
  uint16_t IOCNG3:1;
  uint16_t :2;
  uint16_t IOCNG6:1;
  uint16_t IOCNG7:1;
  uint16_t IOCNG8:1;
  uint16_t IOCNG9:1;
  uint16_t :2;
  uint16_t IOCNG12:1;
  uint16_t IOCNG13:1;
  uint16_t IOCNG14:1;
  uint16_t IOCNG15:1;
} IOCNGBITS;
extern volatile IOCNGBITS IOCNGbits __attribute__((__sfr__));

#define IOCFG IOCFG
extern volatile uint16_t IOCFG __attribute__((__sfr__));
typedef struct tagIOCFGBITS {
  uint16_t IOCFG0:1;
  uint16_t IOCFG1:1;
  uint16_t IOCFG2:1;
  uint16_t IOCFG3:1;
  uint16_t :2;
  uint16_t IOCFG6:1;
  uint16_t IOCFG7:1;
  uint16_t IOCFG8:1;
  uint16_t IOCFG9:1;
  uint16_t :2;
  uint16_t IOCFG12:1;
  uint16_t IOCFG13:1;
  uint16_t IOCFG14:1;
  uint16_t IOCFG15:1;
} IOCFGBITS;
extern volatile IOCFGBITS IOCFGbits __attribute__((__sfr__));

#define CNPUG CNPUG
extern volatile uint16_t CNPUG __attribute__((__sfr__));
__extension__ typedef struct tagCNPUGBITS {
  union {
    struct {
      uint16_t IOCPG0:1;
      uint16_t IOCPG1:1;
      uint16_t IOCPG2:1;
      uint16_t IOCPG3:1;
      uint16_t :2;
      uint16_t IOCPG6:1;
      uint16_t IOCPG7:1;
      uint16_t IOCPG8:1;
      uint16_t IOCPG9:1;
      uint16_t :2;
      uint16_t IOCPG12:1;
      uint16_t IOCPG13:1;
      uint16_t IOCPG14:1;
      uint16_t IOCPG15:1;
    };
    struct {
      uint16_t IOCPUG0:1;
      uint16_t IOCPUG1:1;
      uint16_t IOCPUG2:1;
      uint16_t IOCPUG3:1;
      uint16_t :2;
      uint16_t IOCPUG6:1;
      uint16_t IOCPUG7:1;
      uint16_t IOCPUG8:1;
      uint16_t IOCPUG9:1;
      uint16_t :2;
      uint16_t IOCPUG12:1;
      uint16_t IOCPUG13:1;
      uint16_t IOCPUG14:1;
      uint16_t IOCPUG15:1;
    };
    struct {
      uint16_t CNPUG0:1;
      uint16_t CNPUG1:1;
      uint16_t CNPUG2:1;
      uint16_t CNPUG3:1;
      uint16_t :2;
      uint16_t CNPUG6:1;
      uint16_t CNPUG7:1;
      uint16_t CNPUG8:1;
      uint16_t CNPUG9:1;
      uint16_t :2;
      uint16_t CNPUG12:1;
      uint16_t CNPUG13:1;
      uint16_t CNPUG14:1;
      uint16_t CNPUG15:1;
    };
  };
} CNPUGBITS;
extern volatile CNPUGBITS CNPUGbits __attribute__((__sfr__));

#define IOCPUG IOCPUG
extern volatile uint16_t IOCPUG __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUGBITS {
  union {
    struct {
      uint16_t IOCPG0:1;
      uint16_t IOCPG1:1;
      uint16_t IOCPG2:1;
      uint16_t IOCPG3:1;
      uint16_t :2;
      uint16_t IOCPG6:1;
      uint16_t IOCPG7:1;
      uint16_t IOCPG8:1;
      uint16_t IOCPG9:1;
      uint16_t :2;
      uint16_t IOCPG12:1;
      uint16_t IOCPG13:1;
      uint16_t IOCPG14:1;
      uint16_t IOCPG15:1;
    };
    struct {
      uint16_t IOCPUG0:1;
      uint16_t IOCPUG1:1;
      uint16_t IOCPUG2:1;
      uint16_t IOCPUG3:1;
      uint16_t :2;
      uint16_t IOCPUG6:1;
      uint16_t IOCPUG7:1;
      uint16_t IOCPUG8:1;
      uint16_t IOCPUG9:1;
      uint16_t :2;
      uint16_t IOCPUG12:1;
      uint16_t IOCPUG13:1;
      uint16_t IOCPUG14:1;
      uint16_t IOCPUG15:1;
    };
    struct {
      uint16_t CNPUG0:1;
      uint16_t CNPUG1:1;
      uint16_t CNPUG2:1;
      uint16_t CNPUG3:1;
      uint16_t :2;
      uint16_t CNPUG6:1;
      uint16_t CNPUG7:1;
      uint16_t CNPUG8:1;
      uint16_t CNPUG9:1;
      uint16_t :2;
      uint16_t CNPUG12:1;
      uint16_t CNPUG13:1;
      uint16_t CNPUG14:1;
      uint16_t CNPUG15:1;
    };
  };
} IOCPUGBITS;
extern volatile IOCPUGBITS IOCPUGbits __attribute__((__sfr__));

#define CNPDG CNPDG
extern volatile uint16_t CNPDG __attribute__((__sfr__));
__extension__ typedef struct tagCNPDGBITS {
  union {
    struct {
      uint16_t IOCPDG0:1;
      uint16_t IOCPDG1:1;
      uint16_t IOCPDG2:1;
      uint16_t IOCPDG3:1;
      uint16_t :2;
      uint16_t IOCPDG6:1;
      uint16_t IOCPDG7:1;
      uint16_t IOCPDG8:1;
      uint16_t IOCPDG9:1;
      uint16_t :2;
      uint16_t IOCPDG12:1;
      uint16_t IOCPDG13:1;
      uint16_t IOCPDG14:1;
      uint16_t IOCPDG15:1;
    };
    struct {
      uint16_t CNPDG0:1;
      uint16_t CNPDG1:1;
      uint16_t CNPDG2:1;
      uint16_t CNPDG3:1;
      uint16_t :2;
      uint16_t CNPDG6:1;
      uint16_t CNPDG7:1;
      uint16_t CNPDG8:1;
      uint16_t CNPDG9:1;
      uint16_t :2;
      uint16_t CNPDG12:1;
      uint16_t CNPDG13:1;
      uint16_t CNPDG14:1;
      uint16_t CNPDG15:1;
    };
  };
} CNPDGBITS;
extern volatile CNPDGBITS CNPDGbits __attribute__((__sfr__));

#define IOCPDG IOCPDG
extern volatile uint16_t IOCPDG __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDGBITS {
  union {
    struct {
      uint16_t IOCPDG0:1;
      uint16_t IOCPDG1:1;
      uint16_t IOCPDG2:1;
      uint16_t IOCPDG3:1;
      uint16_t :2;
      uint16_t IOCPDG6:1;
      uint16_t IOCPDG7:1;
      uint16_t IOCPDG8:1;
      uint16_t IOCPDG9:1;
      uint16_t :2;
      uint16_t IOCPDG12:1;
      uint16_t IOCPDG13:1;
      uint16_t IOCPDG14:1;
      uint16_t IOCPDG15:1;
    };
    struct {
      uint16_t CNPDG0:1;
      uint16_t CNPDG1:1;
      uint16_t CNPDG2:1;
      uint16_t CNPDG3:1;
      uint16_t :2;
      uint16_t CNPDG6:1;
      uint16_t CNPDG7:1;
      uint16_t CNPDG8:1;
      uint16_t CNPDG9:1;
      uint16_t :2;
      uint16_t CNPDG12:1;
      uint16_t CNPDG13:1;
      uint16_t CNPDG14:1;
      uint16_t CNPDG15:1;
    };
  };
} IOCPDGBITS;
extern volatile IOCPDGBITS IOCPDGbits __attribute__((__sfr__));

#define TRISH TRISH
extern volatile uint16_t TRISH __attribute__((__sfr__));
typedef struct tagTRISHBITS {
  uint16_t TRISH0:1;
  uint16_t TRISH1:1;
  uint16_t TRISH2:1;
  uint16_t TRISH3:1;
  uint16_t TRISH4:1;
  uint16_t TRISH5:1;
  uint16_t TRISH6:1;
  uint16_t TRISH7:1;
  uint16_t TRISH8:1;
  uint16_t TRISH9:1;
  uint16_t TRISH10:1;
  uint16_t TRISH11:1;
  uint16_t TRISH12:1;
  uint16_t TRISH13:1;
  uint16_t TRISH14:1;
  uint16_t TRISH15:1;
} TRISHBITS;
extern volatile TRISHBITS TRISHbits __attribute__((__sfr__));

