MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA412/mcu.h
#define _IFS3_CCT6IF_POSITION                    0x00000000
#define _IFS3_CCT6IF_MASK                        0x00000001
#define _IFS3_CCT6IF_LENGTH                      0x00000001

#define _IFS3_SI2C2IF_POSITION                   0x00000001
#define _IFS3_SI2C2IF_MASK                       0x00000002
#define _IFS3_SI2C2IF_LENGTH                     0x00000001

#define _IFS3_MI2C2IF_POSITION                   0x00000002
#define _IFS3_MI2C2IF_MASK                       0x00000004
#define _IFS3_MI2C2IF_LENGTH                     0x00000001

#define _IFS3_CCT7IF_POSITION                    0x00000003
#define _IFS3_CCT7IF_MASK                        0x00000008
#define _IFS3_CCT7IF_LENGTH                      0x00000001

#define _IFS3_INT3IF_POSITION                    0x00000005
#define _IFS3_INT3IF_MASK                        0x00000020
#define _IFS3_INT3IF_LENGTH                      0x00000001

#define _IFS3_INT4IF_POSITION                    0x00000006
#define _IFS3_INT4IF_MASK                        0x00000040
#define _IFS3_INT4IF_LENGTH                      0x00000001

#define _IFS3_CRYDNIF_POSITION                   0x00000007
#define _IFS3_CRYDNIF_MASK                       0x00000080
#define _IFS3_CRYDNIF_LENGTH                     0x00000001

#define _IFS3_KEYSTRIF_POSITION                  0x00000008
#define _IFS3_KEYSTRIF_MASK                      0x00000100
#define _IFS3_KEYSTRIF_LENGTH                    0x00000001

#define _IFS3_SPI4RXIF_POSITION                  0x00000009
#define _IFS3_SPI4RXIF_MASK                      0x00000200
#define _IFS3_SPI4RXIF_LENGTH                    0x00000001

#define _IFS3_SPI1RXIF_POSITION                  0x0000000A
#define _IFS3_SPI1RXIF_MASK                      0x00000400
#define _IFS3_SPI1RXIF_LENGTH                    0x00000001

#define _IFS3_SPI2RXIF_POSITION                  0x0000000B
#define _IFS3_SPI2RXIF_MASK                      0x00000800
#define _IFS3_SPI2RXIF_LENGTH                    0x00000001

#define _IFS3_SPI3RXIF_POSITION                  0x0000000C
#define _IFS3_SPI3RXIF_MASK                      0x00001000
#define _IFS3_SPI3RXIF_LENGTH                    0x00000001

#define _IFS3_DMA5IF_POSITION                    0x0000000D
#define _IFS3_DMA5IF_MASK                        0x00002000
#define _IFS3_DMA5IF_LENGTH                      0x00000001

#define _IFS3_RTCIF_POSITION                     0x0000000E
#define _IFS3_RTCIF_MASK                         0x00004000
#define _IFS3_RTCIF_LENGTH                       0x00000001

#define _IFS3_CCP1IF_POSITION                    0x0000000F
#define _IFS3_CCP1IF_MASK                        0x00008000
#define _IFS3_CCP1IF_LENGTH                      0x00000001

#define _IFS4_CCP2IF_POSITION                    0x00000000
#define _IFS4_CCP2IF_MASK                        0x00000001
#define _IFS4_CCP2IF_LENGTH                      0x00000001

#define _IFS4_U1ERIF_POSITION                    0x00000001
#define _IFS4_U1ERIF_MASK                        0x00000002
#define _IFS4_U1ERIF_LENGTH                      0x00000001

#define _IFS4_U2ERIF_POSITION                    0x00000002
#define _IFS4_U2ERIF_MASK                        0x00000004
#define _IFS4_U2ERIF_LENGTH                      0x00000001

#define _IFS4_CRCIF_POSITION                     0x00000003
#define _IFS4_CRCIF_MASK                         0x00000008
#define _IFS4_CRCIF_LENGTH                       0x00000001

#define _IFS4_SI2C3IF_POSITION                   0x00000006
#define _IFS4_SI2C3IF_MASK                       0x00000040
#define _IFS4_SI2C3IF_LENGTH                     0x00000001

#define _IFS4_MI2C3IF_POSITION                   0x00000007
#define _IFS4_MI2C3IF_MASK                       0x00000080
#define _IFS4_MI2C3IF_LENGTH                     0x00000001

#define _IFS4_LVDIF_POSITION                     0x00000008
#define _IFS4_LVDIF_MASK                         0x00000100
#define _IFS4_LVDIF_LENGTH                       0x00000001

#define _IFS4_CCP7IF_POSITION                    0x00000009
#define _IFS4_CCP7IF_MASK                        0x00000200
#define _IFS4_CCP7IF_LENGTH                      0x00000001

#define _IFS4_CTMUIF_POSITION                    0x0000000D
#define _IFS4_CTMUIF_MASK                        0x00002000
#define _IFS4_CTMUIF_LENGTH                      0x00000001

#define _IFS4_DAC1IF_POSITION                    0x0000000E
#define _IFS4_DAC1IF_MASK                        0x00004000
#define _IFS4_DAC1IF_LENGTH                      0x00000001

#define _IFS5_U3ERIF_POSITION                    0x00000001
#define _IFS5_U3ERIF_MASK                        0x00000002
#define _IFS5_U3ERIF_LENGTH                      0x00000001

#define _IFS5_U3RXIF_POSITION                    0x00000002
#define _IFS5_U3RXIF_MASK                        0x00000004
#define _IFS5_U3RXIF_LENGTH                      0x00000001

#define _IFS5_U3TXIF_POSITION                    0x00000003
#define _IFS5_U3TXIF_MASK                        0x00000008
#define _IFS5_U3TXIF_LENGTH                      0x00000001

#define _IFS5_I2C1BCIF_POSITION                  0x00000004
#define _IFS5_I2C1BCIF_MASK                      0x00000010
#define _IFS5_I2C1BCIF_LENGTH                    0x00000001

#define _IFS5_I2C2BCIF_POSITION                  0x00000005
#define _IFS5_I2C2BCIF_MASK                      0x00000020
#define _IFS5_I2C2BCIF_LENGTH                    0x00000001

#define _IFS5_USB1IF_POSITION                    0x00000006
#define _IFS5_USB1IF_MASK                        0x00000040
#define _IFS5_USB1IF_LENGTH                      0x00000001

#define _IFS5_U4ERIF_POSITION                    0x00000007
#define _IFS5_U4ERIF_MASK                        0x00000080
#define _IFS5_U4ERIF_LENGTH                      0x00000001

#define _IFS5_U4RXIF_POSITION                    0x00000008
#define _IFS5_U4RXIF_MASK                        0x00000100
#define _IFS5_U4RXIF_LENGTH                      0x00000001

#define _IFS5_U4TXIF_POSITION                    0x00000009
#define _IFS5_U4TXIF_MASK                        0x00000200
#define _IFS5_U4TXIF_LENGTH                      0x00000001

