MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA412/mcu.h
#define _IOCFC_IOCFC4_POSITION                   0x00000004
#define _IOCFC_IOCFC4_MASK                       0x00000010
#define _IOCFC_IOCFC4_LENGTH                     0x00000001

#define _IOCFC_IOCFC12_POSITION                  0x0000000C
#define _IOCFC_IOCFC12_MASK                      0x00001000
#define _IOCFC_IOCFC12_LENGTH                    0x00000001

#define _IOCFC_IOCFC13_POSITION                  0x0000000D
#define _IOCFC_IOCFC13_MASK                      0x00002000
#define _IOCFC_IOCFC13_LENGTH                    0x00000001

#define _IOCFC_IOCFC14_POSITION                  0x0000000E
#define _IOCFC_IOCFC14_MASK                      0x00004000
#define _IOCFC_IOCFC14_LENGTH                    0x00000001

#define _IOCFC_IOCFC15_POSITION                  0x0000000F
#define _IOCFC_IOCFC15_MASK                      0x00008000
#define _IOCFC_IOCFC15_LENGTH                    0x00000001

#define _CNPUC_IOCPC1_POSITION                   0x00000001
#define _CNPUC_IOCPC1_MASK                       0x00000002
#define _CNPUC_IOCPC1_LENGTH                     0x00000001

#define _CNPUC_IOCPC2_POSITION                   0x00000002
#define _CNPUC_IOCPC2_MASK                       0x00000004
#define _CNPUC_IOCPC2_LENGTH                     0x00000001

#define _CNPUC_IOCPC3_POSITION                   0x00000003
#define _CNPUC_IOCPC3_MASK                       0x00000008
#define _CNPUC_IOCPC3_LENGTH                     0x00000001

#define _CNPUC_IOCPC4_POSITION                   0x00000004
#define _CNPUC_IOCPC4_MASK                       0x00000010
#define _CNPUC_IOCPC4_LENGTH                     0x00000001

#define _CNPUC_IOCPC12_POSITION                  0x0000000C
#define _CNPUC_IOCPC12_MASK                      0x00001000
#define _CNPUC_IOCPC12_LENGTH                    0x00000001

#define _CNPUC_IOCPC15_POSITION                  0x0000000F
#define _CNPUC_IOCPC15_MASK                      0x00008000
#define _CNPUC_IOCPC15_LENGTH                    0x00000001

#define _CNPUC_IOCPUC1_POSITION                  0x00000001
#define _CNPUC_IOCPUC1_MASK                      0x00000002
#define _CNPUC_IOCPUC1_LENGTH                    0x00000001

#define _CNPUC_IOCPUC2_POSITION                  0x00000002
#define _CNPUC_IOCPUC2_MASK                      0x00000004
#define _CNPUC_IOCPUC2_LENGTH                    0x00000001

#define _CNPUC_IOCPUC3_POSITION                  0x00000003
#define _CNPUC_IOCPUC3_MASK                      0x00000008
#define _CNPUC_IOCPUC3_LENGTH                    0x00000001

#define _CNPUC_IOCPUC4_POSITION                  0x00000004
#define _CNPUC_IOCPUC4_MASK                      0x00000010
#define _CNPUC_IOCPUC4_LENGTH                    0x00000001

#define _CNPUC_IOCPUC12_POSITION                 0x0000000C
#define _CNPUC_IOCPUC12_MASK                     0x00001000
#define _CNPUC_IOCPUC12_LENGTH                   0x00000001

#define _CNPUC_IOCPUC15_POSITION                 0x0000000F
#define _CNPUC_IOCPUC15_MASK                     0x00008000
#define _CNPUC_IOCPUC15_LENGTH                   0x00000001

#define _CNPUC_CNPUC1_POSITION                   0x00000001
#define _CNPUC_CNPUC1_MASK                       0x00000002
#define _CNPUC_CNPUC1_LENGTH                     0x00000001

#define _CNPUC_CNPUC2_POSITION                   0x00000002
#define _CNPUC_CNPUC2_MASK                       0x00000004
#define _CNPUC_CNPUC2_LENGTH                     0x00000001

#define _CNPUC_CNPUC3_POSITION                   0x00000003
#define _CNPUC_CNPUC3_MASK                       0x00000008
#define _CNPUC_CNPUC3_LENGTH                     0x00000001

#define _CNPUC_CNPUC4_POSITION                   0x00000004
#define _CNPUC_CNPUC4_MASK                       0x00000010
#define _CNPUC_CNPUC4_LENGTH                     0x00000001

#define _CNPUC_CNPUC12_POSITION                  0x0000000C
#define _CNPUC_CNPUC12_MASK                      0x00001000
#define _CNPUC_CNPUC12_LENGTH                    0x00000001

#define _CNPUC_CNPUC15_POSITION                  0x0000000F
#define _CNPUC_CNPUC15_MASK                      0x00008000
#define _CNPUC_CNPUC15_LENGTH                    0x00000001

#define _IOCPUC_IOCPC1_POSITION                  0x00000001
#define _IOCPUC_IOCPC1_MASK                      0x00000002
#define _IOCPUC_IOCPC1_LENGTH                    0x00000001

#define _IOCPUC_IOCPC2_POSITION                  0x00000002
#define _IOCPUC_IOCPC2_MASK                      0x00000004
#define _IOCPUC_IOCPC2_LENGTH                    0x00000001

#define _IOCPUC_IOCPC3_POSITION                  0x00000003
#define _IOCPUC_IOCPC3_MASK                      0x00000008
#define _IOCPUC_IOCPC3_LENGTH                    0x00000001

#define _IOCPUC_IOCPC4_POSITION                  0x00000004
#define _IOCPUC_IOCPC4_MASK                      0x00000010
#define _IOCPUC_IOCPC4_LENGTH                    0x00000001

#define _IOCPUC_IOCPC12_POSITION                 0x0000000C
#define _IOCPUC_IOCPC12_MASK                     0x00001000
#define _IOCPUC_IOCPC12_LENGTH                   0x00000001

#define _IOCPUC_IOCPC15_POSITION                 0x0000000F
#define _IOCPUC_IOCPC15_MASK                     0x00008000
#define _IOCPUC_IOCPC15_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC1_POSITION                 0x00000001
#define _IOCPUC_IOCPUC1_MASK                     0x00000002
#define _IOCPUC_IOCPUC1_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC2_POSITION                 0x00000002
#define _IOCPUC_IOCPUC2_MASK                     0x00000004
#define _IOCPUC_IOCPUC2_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC3_POSITION                 0x00000003
#define _IOCPUC_IOCPUC3_MASK                     0x00000008
#define _IOCPUC_IOCPUC3_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC4_POSITION                 0x00000004
#define _IOCPUC_IOCPUC4_MASK                     0x00000010
#define _IOCPUC_IOCPUC4_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC12_POSITION                0x0000000C
#define _IOCPUC_IOCPUC12_MASK                    0x00001000
#define _IOCPUC_IOCPUC12_LENGTH                  0x00000001

#define _IOCPUC_IOCPUC15_POSITION                0x0000000F
#define _IOCPUC_IOCPUC15_MASK                    0x00008000
#define _IOCPUC_IOCPUC15_LENGTH                  0x00000001

