MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA412/mcu.h
#define _LATD_LATD8_POSITION                     0x00000008
#define _LATD_LATD8_MASK                         0x00000100
#define _LATD_LATD8_LENGTH                       0x00000001

#define _LATD_LATD9_POSITION                     0x00000009
#define _LATD_LATD9_MASK                         0x00000200
#define _LATD_LATD9_LENGTH                       0x00000001

#define _LATD_LATD10_POSITION                    0x0000000A
#define _LATD_LATD10_MASK                        0x00000400
#define _LATD_LATD10_LENGTH                      0x00000001

#define _LATD_LATD11_POSITION                    0x0000000B
#define _LATD_LATD11_MASK                        0x00000800
#define _LATD_LATD11_LENGTH                      0x00000001

#define _LATD_LATD12_POSITION                    0x0000000C
#define _LATD_LATD12_MASK                        0x00001000
#define _LATD_LATD12_LENGTH                      0x00000001

#define _LATD_LATD13_POSITION                    0x0000000D
#define _LATD_LATD13_MASK                        0x00002000
#define _LATD_LATD13_LENGTH                      0x00000001

#define _LATD_LATD14_POSITION                    0x0000000E
#define _LATD_LATD14_MASK                        0x00004000
#define _LATD_LATD14_LENGTH                      0x00000001

#define _LATD_LATD15_POSITION                    0x0000000F
#define _LATD_LATD15_MASK                        0x00008000
#define _LATD_LATD15_LENGTH                      0x00000001

#define _ODCD_ODCD0_POSITION                     0x00000000
#define _ODCD_ODCD0_MASK                         0x00000001
#define _ODCD_ODCD0_LENGTH                       0x00000001

#define _ODCD_ODCD1_POSITION                     0x00000001
#define _ODCD_ODCD1_MASK                         0x00000002
#define _ODCD_ODCD1_LENGTH                       0x00000001

#define _ODCD_ODCD2_POSITION                     0x00000002
#define _ODCD_ODCD2_MASK                         0x00000004
#define _ODCD_ODCD2_LENGTH                       0x00000001

#define _ODCD_ODCD3_POSITION                     0x00000003
#define _ODCD_ODCD3_MASK                         0x00000008
#define _ODCD_ODCD3_LENGTH                       0x00000001

#define _ODCD_ODCD4_POSITION                     0x00000004
#define _ODCD_ODCD4_MASK                         0x00000010
#define _ODCD_ODCD4_LENGTH                       0x00000001

#define _ODCD_ODCD5_POSITION                     0x00000005
#define _ODCD_ODCD5_MASK                         0x00000020
#define _ODCD_ODCD5_LENGTH                       0x00000001

#define _ODCD_ODCD6_POSITION                     0x00000006
#define _ODCD_ODCD6_MASK                         0x00000040
#define _ODCD_ODCD6_LENGTH                       0x00000001

#define _ODCD_ODCD7_POSITION                     0x00000007
#define _ODCD_ODCD7_MASK                         0x00000080
#define _ODCD_ODCD7_LENGTH                       0x00000001

#define _ODCD_ODCD8_POSITION                     0x00000008
#define _ODCD_ODCD8_MASK                         0x00000100
#define _ODCD_ODCD8_LENGTH                       0x00000001

#define _ODCD_ODCD9_POSITION                     0x00000009
#define _ODCD_ODCD9_MASK                         0x00000200
#define _ODCD_ODCD9_LENGTH                       0x00000001

#define _ODCD_ODCD10_POSITION                    0x0000000A
#define _ODCD_ODCD10_MASK                        0x00000400
#define _ODCD_ODCD10_LENGTH                      0x00000001

#define _ODCD_ODCD11_POSITION                    0x0000000B
#define _ODCD_ODCD11_MASK                        0x00000800
#define _ODCD_ODCD11_LENGTH                      0x00000001

#define _ODCD_ODCD12_POSITION                    0x0000000C
#define _ODCD_ODCD12_MASK                        0x00001000
#define _ODCD_ODCD12_LENGTH                      0x00000001

#define _ODCD_ODCD13_POSITION                    0x0000000D
#define _ODCD_ODCD13_MASK                        0x00002000
#define _ODCD_ODCD13_LENGTH                      0x00000001

#define _ODCD_ODCD14_POSITION                    0x0000000E
#define _ODCD_ODCD14_MASK                        0x00004000
#define _ODCD_ODCD14_LENGTH                      0x00000001

#define _ODCD_ODCD15_POSITION                    0x0000000F
#define _ODCD_ODCD15_MASK                        0x00008000
#define _ODCD_ODCD15_LENGTH                      0x00000001

#define _ANSD_ANSD0_POSITION                     0x00000000
#define _ANSD_ANSD0_MASK                         0x00000001
#define _ANSD_ANSD0_LENGTH                       0x00000001

#define _ANSD_ANSD1_POSITION                     0x00000001
#define _ANSD_ANSD1_MASK                         0x00000002
#define _ANSD_ANSD1_LENGTH                       0x00000001

#define _ANSD_ANSD2_POSITION                     0x00000002
#define _ANSD_ANSD2_MASK                         0x00000004
#define _ANSD_ANSD2_LENGTH                       0x00000001

#define _ANSD_ANSD3_POSITION                     0x00000003
#define _ANSD_ANSD3_MASK                         0x00000008
#define _ANSD_ANSD3_LENGTH                       0x00000001

#define _ANSD_ANSD4_POSITION                     0x00000004
#define _ANSD_ANSD4_MASK                         0x00000010
#define _ANSD_ANSD4_LENGTH                       0x00000001

#define _ANSD_ANSD5_POSITION                     0x00000005
#define _ANSD_ANSD5_MASK                         0x00000020
#define _ANSD_ANSD5_LENGTH                       0x00000001

#define _ANSD_ANSD6_POSITION                     0x00000006
#define _ANSD_ANSD6_MASK                         0x00000040
#define _ANSD_ANSD6_LENGTH                       0x00000001

#define _ANSD_ANSD7_POSITION                     0x00000007
#define _ANSD_ANSD7_MASK                         0x00000080
#define _ANSD_ANSD7_LENGTH                       0x00000001

#define _ANSD_ANSD8_POSITION                     0x00000008
#define _ANSD_ANSD8_MASK                         0x00000100
#define _ANSD_ANSD8_LENGTH                       0x00000001

#define _ANSD_ANSD9_POSITION                     0x00000009
#define _ANSD_ANSD9_MASK                         0x00000200
#define _ANSD_ANSD9_LENGTH                       0x00000001

#define _ANSD_ANSD10_POSITION                    0x0000000A
#define _ANSD_ANSD10_MASK                        0x00000400
#define _ANSD_ANSD10_LENGTH                      0x00000001

#define _ANSD_ANSD11_POSITION                    0x0000000B
#define _ANSD_ANSD11_MASK                        0x00000800
#define _ANSD_ANSD11_LENGTH                      0x00000001

#define _ANSD_ANSD12_POSITION                    0x0000000C
#define _ANSD_ANSD12_MASK                        0x00001000
#define _ANSD_ANSD12_LENGTH                      0x00000001

#define _ANSD_ANSD13_POSITION                    0x0000000D
#define _ANSD_ANSD13_MASK                        0x00002000
#define _ANSD_ANSD13_LENGTH                      0x00000001

